**`commonimages/base/rhel_7_9`** terragrunt plan on `push` event [#344](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_ami.parent[0]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/base-rhel-7-9"
        name         = "base_rhel_7_9"
      ~ tags         = {
          ~ "image-recipe"                    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
          ~ "infrastructure-configuration"    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
            # (11 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "image-recipe"                    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
          ~ "infrastructure-configuration"    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-rhel-7-9" -> (known after apply)
      ~ date_created                     = "2023-06-08T09:43:44.833Z" -> (known after apply)
      ~ date_last_run                    = "2023-07-01T00:00:29.814Z" -> (known after apply)
      ~ date_next_run                    = "2023-10-01T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-06-08T09:43:44.833Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-rhel-7-9" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-7-9/0.0.9" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-rhel-7-9-0-0-9" -> (known after apply)
        name                             = "base_rhel_7_9"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "image-recipe"                    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
          ~ "infrastructure-configuration"    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
            # (11 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "image-recipe"                    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
          ~ "infrastructure-configuration"    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      + image_scanning_configuration {
          + image_scanning_enabled = (known after apply)

          + ecr_configuration {
              + container_tags  = (known after apply)
              + repository_name = (known after apply)
            }
        }

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-7-9/0.0.9" -> (known after apply)
      ~ date_created     = "2023-06-08T09:43:43.869Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-7-9/0.0.9" -> (known after apply)
        name             = "base_rhel_7_9"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
          ~ "image-recipe"                    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
          ~ "infrastructure-configuration"    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
            # (11 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "image-recipe"                    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
          ~ "infrastructure-configuration"    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
            # (11 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.9" -> "0.1.0" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-rhel-7-9-0-0-9" -> (known after apply)
      ~ date_created                  = "2023-06-08T09:43:43.733Z" -> (known after apply)
      ~ date_updated                  = "2023-06-22T14:49:39.065Z" -> (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/base-rhel-7-9-0-0-9" -> (known after apply)
      ~ name                          = "base_rhel_7_9_0_0_9" -> "base_rhel_7_9_0_1_0" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
          ~ "infrastructure-configuration"    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
            # (11 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-recipe"                    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
          ~ "infrastructure-configuration"    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
            # (11 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-recipe"                    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
          ~ "infrastructure-configuration"    = "base_rhel_7_9/0.0.9" -> "base_rhel_7_9/0.1.0"
            # (11 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
